---
kind: property
id: P:Autodesk.Revit.DB.MEPModel.IsValidObject
source: html/22d4a204-563b-54f2-4f1a-3d5336b1d104.htm
---
# Autodesk.Revit.DB.MEPModel.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.